; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v12 ?v2)
             (pred_4 ?v11 ?v4)
             (pred_7 ?v12 ?v4)
             (pred_12 ?v1 ?v12 )
	     (pred_11 ?v12)
             (pred_6 ?v9)
             (pred_1 ?v11)
             (pred_2 ?v4)
             (pred_8 ?v12)
             (pred_9 ?v11)
             (pred_10 ?v12)
             (pred_5 ))



(:action op_4
:parameters (?v13 ?v5 ?v6 ?v10)
:precondition (and (pred_6 ?v13) (pred_6 ?v5) (pred_1 ?v6) (pred_2 ?v10)
          (pred_3 ?v13 ?v5) (pred_4 ?v6 ?v10)
                   (pred_7 ?v5 ?v10) (pred_11 ?v13) 
                   (pred_8 ?v5) (pred_9 ?v6))
:effect (and  (pred_10 ?v5) (not (pred_8 ?v5))))


(:action op_2
:parameters (?v13 ?v7)
:precondition (and (pred_6 ?v13) (pred_6 ?v7)
               (pred_11 ?v13) (pred_3 ?v13 ?v7) (pred_10 ?v7))
:effect (and (pred_11 ?v7) (not (pred_11 ?v13))))

(:action op_1
:parameters (?v13 ?v6)
:precondition (and (pred_6 ?v13) (pred_1 ?v6) 
                  (pred_11 ?v13) (pred_12 ?v6 ?v13) (pred_5 ))
:effect (and (pred_9 ?v6)
   (not (pred_12 ?v6 ?v13)) (not (pred_5 ))))


(:action op_3
:parameters (?v13 ?v8 ?v3)
:precondition (and (pred_6 ?v13) (pred_1 ?v8) (pred_1 ?v3)
                  (pred_11 ?v13) (pred_9 ?v3) (pred_12 ?v8 ?v13))
:effect (and (pred_9 ?v8) (pred_12 ?v3 ?v13)
        (not (pred_9 ?v3)) (not (pred_12 ?v8 ?v13))))

(:action op_5
:parameters (?v13 ?v6)
:precondition (and (pred_6 ?v13) (pred_1 ?v6) 
                  (pred_11 ?v13) (pred_9 ?v6))
:effect (and (pred_5 ) (pred_12 ?v6 ?v13) (not (pred_9 ?v6)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_26 obj_30 obj_14 obj_27 obj_13 obj_23 obj_05 obj_12 obj_22 obj_10 obj_17 obj_29 obj_18 obj_03 obj_01 obj_06 obj_31 obj_16 obj_28 obj_19 obj_21 obj_07 obj_02 obj_09 obj_15
    obj_11 obj_25 obj_08
    obj_24 obj_20 obj_04
    )

    (:init
       (pred_5)

       (pred_6 obj_26)
       (pred_6 obj_30)
       (pred_6 obj_14)
       (pred_6 obj_27)
       (pred_6 obj_13)
       (pred_6 obj_23)
       (pred_6 obj_05)
       (pred_6 obj_12)
       (pred_6 obj_22)
       (pred_6 obj_10)
       (pred_6 obj_17)
       (pred_6 obj_29)
       (pred_6 obj_18)
       (pred_6 obj_03)
       (pred_6 obj_01)
       (pred_6 obj_06)
       (pred_6 obj_31)
       (pred_6 obj_16)
       (pred_6 obj_28)
       (pred_6 obj_19)
       (pred_6 obj_21)
       (pred_6 obj_07)
       (pred_6 obj_02)
       (pred_6 obj_09)
       (pred_6 obj_15)
       (pred_2 obj_11)
       (pred_2 obj_25)
       (pred_2 obj_08)
       (pred_1 obj_24)
       (pred_1 obj_20)
       (pred_1 obj_04)

       (pred_3 obj_26 obj_23)
       (pred_3 obj_26 obj_30)
       (pred_3 obj_30 obj_05)
       (pred_3 obj_30 obj_14)
       (pred_3 obj_30 obj_26)
       (pred_3 obj_14 obj_12)
       (pred_3 obj_14 obj_27)
       (pred_3 obj_14 obj_30)
       (pred_3 obj_27 obj_22)
       (pred_3 obj_27 obj_13)
       (pred_3 obj_27 obj_14)
       (pred_3 obj_13 obj_10)
       (pred_3 obj_13 obj_27)
       (pred_3 obj_23 obj_17)
       (pred_3 obj_23 obj_05)
       (pred_3 obj_23 obj_26)
       (pred_3 obj_05 obj_29)
       (pred_3 obj_05 obj_12)
       (pred_3 obj_05 obj_30)
       (pred_3 obj_05 obj_23)
       (pred_3 obj_12 obj_18)
       (pred_3 obj_12 obj_22)
       (pred_3 obj_12 obj_14)
       (pred_3 obj_12 obj_05)
       (pred_3 obj_22 obj_03)
       (pred_3 obj_22 obj_10)
       (pred_3 obj_22 obj_27)
       (pred_3 obj_22 obj_12)
       (pred_3 obj_10 obj_01)
       (pred_3 obj_10 obj_13)
       (pred_3 obj_10 obj_22)
       (pred_3 obj_17 obj_06)
       (pred_3 obj_17 obj_29)
       (pred_3 obj_17 obj_23)
       (pred_3 obj_29 obj_31)
       (pred_3 obj_29 obj_18)
       (pred_3 obj_29 obj_05)
       (pred_3 obj_29 obj_17)
       (pred_3 obj_18 obj_16)
       (pred_3 obj_18 obj_03)
       (pred_3 obj_18 obj_12)
       (pred_3 obj_18 obj_29)
       (pred_3 obj_03 obj_28)
       (pred_3 obj_03 obj_01)
       (pred_3 obj_03 obj_22)
       (pred_3 obj_03 obj_18)
       (pred_3 obj_01 obj_19)
       (pred_3 obj_01 obj_10)
       (pred_3 obj_01 obj_03)
       (pred_3 obj_06 obj_21)
       (pred_3 obj_06 obj_31)
       (pred_3 obj_06 obj_17)
       (pred_3 obj_31 obj_07)
       (pred_3 obj_31 obj_16)
       (pred_3 obj_31 obj_29)
       (pred_3 obj_31 obj_06)
       (pred_3 obj_16 obj_02)
       (pred_3 obj_16 obj_28)
       (pred_3 obj_16 obj_18)
       (pred_3 obj_16 obj_31)
       (pred_3 obj_28 obj_09)
       (pred_3 obj_28 obj_19)
       (pred_3 obj_28 obj_03)
       (pred_3 obj_28 obj_16)
       (pred_3 obj_19 obj_15)
       (pred_3 obj_19 obj_01)
       (pred_3 obj_19 obj_28)
       (pred_3 obj_21 obj_07)
       (pred_3 obj_21 obj_06)
       (pred_3 obj_07 obj_02)
       (pred_3 obj_07 obj_31)
       (pred_3 obj_07 obj_21)
       (pred_3 obj_02 obj_09)
       (pred_3 obj_02 obj_16)
       (pred_3 obj_02 obj_07)
       (pred_3 obj_09 obj_15)
       (pred_3 obj_09 obj_28)
       (pred_3 obj_09 obj_02)
       (pred_3 obj_15 obj_19)
       (pred_3 obj_15 obj_09)
       (pred_8 obj_17)
       (pred_8 obj_29)
       (pred_8 obj_31)
       (pred_7  obj_17 obj_11)
       (pred_7  obj_29 obj_25)
       (pred_7  obj_31 obj_08)
       (pred_10 obj_26)
       (pred_10 obj_30)
       (pred_10 obj_14)
       (pred_10 obj_27)
       (pred_10 obj_13)
       (pred_10 obj_23)
       (pred_10 obj_05)
       (pred_10 obj_12)
       (pred_10 obj_22)
       (pred_10 obj_10)
       (pred_10 obj_18)
       (pred_10 obj_03)
       (pred_10 obj_01)
       (pred_10 obj_06)
       (pred_10 obj_16)
       (pred_10 obj_28)
       (pred_10 obj_19)
       (pred_10 obj_21)
       (pred_10 obj_07)
       (pred_10 obj_02)
       (pred_10 obj_09)
       (pred_10 obj_15)

       (pred_4  obj_24 obj_11)
       (pred_4  obj_20 obj_25)
       (pred_4  obj_04 obj_08)
       (pred_12 obj_24 obj_14)
       (pred_12 obj_20 obj_02)
       (pred_12 obj_04 obj_18)
       (pred_11 obj_06)
    )

    (:goal (and
       (pred_12 obj_20 obj_13)
       (pred_12 obj_04 obj_05)
    ))
(:constraints
  (always (not (pred_11 obj_12)))
)
)

; plan
1. (op_2 obj_06 obj_21)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_21)
   goals met: 0 of 2
2. (op_2 obj_21 obj_07)
   deleted: (pred_11 obj_21)
   added: (pred_11 obj_07)
   goals met: 0 of 2
3. (op_2 obj_07 obj_02)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_02)
   goals met: 0 of 2
4. (op_1 obj_02 obj_20)
   deleted: (pred_12 obj_20 obj_02) (pred_5)
   added: (pred_9 obj_20)
   goals met: 0 of 2
5. (op_2 obj_02 obj_16)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_16)
   goals met: 0 of 2
6. (op_2 obj_16 obj_18)
   deleted: (pred_11 obj_16)
   added: (pred_11 obj_18)
   goals met: 0 of 2
7. (op_4 obj_18 obj_29 obj_20 obj_25)
   deleted: (pred_8 obj_29)
   added: (pred_10 obj_29)
   goals met: 0 of 2
8. (op_3 obj_18 obj_04 obj_20)
   deleted: (pred_9 obj_20) (pred_12 obj_04 obj_18)
   added: (pred_9 obj_04) (pred_12 obj_20 obj_18)
   goals met: 0 of 2
9. (op_2 obj_18 obj_29)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_29)
   goals met: 0 of 2
10. (op_2 obj_29 obj_05)
   deleted: (pred_11 obj_29)
   added: (pred_11 obj_05)
   goals met: 0 of 2
11. (op_5 obj_05 obj_04)
   deleted: (pred_9 obj_04)
   added: (pred_5) (pred_12 obj_04 obj_05)
   goals met: 1 of 2
12. (op_2 obj_05 obj_29)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_29)
   goals met: 1 of 2
13. (op_2 obj_29 obj_18)
   deleted: (pred_11 obj_29)
   added: (pred_11 obj_18)
   goals met: 1 of 2
14. (op_1 obj_18 obj_20)
   deleted: (pred_12 obj_20 obj_18) (pred_5)
   added: (pred_9 obj_20)
   goals met: 1 of 2
15. (op_2 obj_18 obj_03)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_03)
   goals met: 1 of 2
16. (op_2 obj_03 obj_22)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_22)
   goals met: 1 of 2
17. (op_2 obj_22 obj_27)
   deleted: (pred_11 obj_22)
   added: (pred_11 obj_27)
   goals met: 1 of 2
18. (op_2 obj_27 obj_13)
   deleted: (pred_11 obj_27)
   added: (pred_11 obj_13)
   goals met: 1 of 2
19. (op_5 obj_13 obj_20)
   deleted: (pred_9 obj_20)
   added: (pred_5) (pred_12 obj_20 obj_13)
   goals met: 2 of 2
